
{
  "version": "1.9.0",
  "author": "Климов Евгений",
  "contact": "https://t.me/eklimov",
  "changelog": [
    {
      "version": "1.9.0",
      "date": "07.09.2025",
      "changes": [
        "В мастер настройки добавлена интеллектуальная система поиска прокси-серверов с помощью ИИ.",
        "Реализовано расширенное тестирование прокси (статус, скорость, геолокация) в мастере и настройках.",
        "В настройки добавлены инструменты для массового обновления и очистки списка прокси-серверов.",
        "Убрана ненадежная функция автоматической настройки SQL, заменена на улучшенную ручную инструкцию."
      ]
    },
    {
      "version": "1.8.0",
      "date": "06.09.2025",
      "changes": [
        "Улучшена обработка ошибок геолокации от Gemini с предложением настроить прокси.",
        "Добавлена система управления прокси-серверами: глобальное включение/отключение и активация отдельных серверов.",
        "Обновлена система версионирования и актуализирована история изменений."
      ]
    },
    {
      "version": "1.7.0",
      "date": "05.09.2025",
      "changes": [
        "Обновлен дизайн и UX/UI: упрощена шапка, переработана панель ввода, кнопка 'Новый чат' перенесена вниз с подтверждением, а кнопка 'Выйти' — в настройки.",
        "Исправлена работа камеры на мобильных устройствах, теперь по умолчанию используется основная (задняя) камера.",
        "Повышена стабильность модального окна настроек, исправлена ошибка с кнопкой 'Сохранить и закрыть'.",
        "Название приложения в шапке теперь является ссылкой для перезагрузки страницы.",
        "В шапке убран индикатор подключения к Supabase/Google для более чистого вида."
      ]
    },
    {
      "version": "1.6.0",
      "date": "04.09.2025",
      "changes": [
        "Добавлено сохранение всех настроек пользователя (ключи, прокси, сервисы) в облако Supabase.",
        "При входе в аккаунт настройки автоматически загружаются, обеспечивая синхронизацию между устройствами.",
        "Обновлен SQL-скрипт для поддержки хранения пользовательских настроек."
      ]
    },
    {
      "version": "1.5.0",
      "date": "03.09.2025",
      "changes": [
        "Добавлена подробная инструкция по настройке прокси-сервера для обхода региональных ограничений.",
        "Настройки прокси-сервера перенесены в раздел 'Подключения' для большей логичности.",
        "В инструкцию добавлены готовые примеры кода для Cloudflare Workers и Vercel."
      ]
    },
    {
      "version": "1.4.0",
      "date": "02.09.2025",
      "changes": [
        "Исправлена ошибка загрузки библиотеки для обработки PDF-файлов.",
        "Добавлена возможность изменять существующие задачи (название, срок, заметки).",
        "Улучшена логика ИИ: ассистент теперь всегда предлагает ссылку для открытия найденных документов.",
        "Улучшено сохранение контекста в диалоге для более естественного взаимодействия."
      ]
    },
    {
      "version": "1.3.0",
      "date": "30.08.2025",
      "changes": [
        "Улучшена обработка ответов от Gemini API для повышения стабильности приложения.",
        "Обновлена информация об авторе."
      ]
    },
    {
      "version": "1.2.0",
      "date": "29.08.2025",
      "changes": [
        "Добавлен 'Центр Помощи' с ИИ-анализом любых ошибок.",
        "В настройки добавлена вкладка 'О приложении' с историей версий.",
        "Улучшена и упрощена интерактивная инструкция по настройке."
      ]
    },
    {
      "version": "1.1.0",
      "date": "28.08.2025",
      "changes": [
        "Добавлен интерактивный анализ ошибок синхронизации.",
        "Повышена стабильность синхронизации почты."
      ]
    },
    {
      "version": "1.0.0",
      "date": "27.08.2025",
      "changes": [
        "Первоначальный выпуск приложения."
      ]
    }
  ]
}